Repository: lfunderburk/Fairlearn-es
Catalog: docs/locale/*/LC_MESSAGES/about/index.po
Languages: es

source: About Us
es: Sobre nosotros

source: Mission
es: Misión

source: Fairlearn is an open-source, community-driven project to help data scientists improve fairness of AI systems.
es: Fairlearn es un proyecto de código abierto impulsado por la comunidad para ayudar a los científicos de datos a mejorar la equidad de los sistemas de IA.

source: The project aspires to include:
es: El proyecto aspira a incluir:

source: A Python library for fairness assessment and improvement (fairness metrics, mitigation algorithms, plotting, etc.)
es: Una biblioteca de Python para la evaluación y mejora de la equidad (métricas de equidad, algoritmos de mitigación, uso de gráficos, etc.)

source: Educational resources covering organizational and technical processes for unfairness mitigation (comprehensive user guide, detailed case studies, Jupyter notebooks, white papers, etc.)
es: Recursos educativos que cubren procesos organizacionales y técnicos para la mitigación de la injusticia (guía completa del usuario, estudios de casos detallados, cuadernos de Jupyter, libros blancos, etc.)

source: Development of Fairlearn is firmly grounded in the understanding that fairness in AI systems is a sociotechnical challenge. Because there are many complex sources of unfairness --- some societal and some technical --- it is not possible to fully "debias" a system or to guarantee fairness. Our goal is to enable humans to assess fairness-related harms, review the impacts of different mitigation strategies and then make trade-offs appropriate to their scenario.
es: El desarrollo de Fairlearn se basa firmemente en el entendimiento de que la equidad en los sistemas de IA es un desafío sociotécnico. Debido a que hay muchas fuentes complejas de injusticia --- algunas --- sociales y algunas técnicas, no es posible remover el prejuicio completamente un sistema o garantizar la equidad. Nuestro objetivo es permitir que los humanos evalúen los daños relacionados con la equidad, revisen los impactos de las diferentes estrategias de mitigación y luego hagan concesiones apropiadas para su escenario.

source: Fairlearn is a community-driven open source project! The development and growth of Fairlearn are guided by the belief that meaningful progress toward fairer AI systems requires input from a breadth of perspectives, ranging from data scientists, developers, and business decision makers to the people whose lives may be affected by the predictions of AI systems.
es: ¡Fairlearn es un proyecto de código abierto impulsado por la comunidad! El desarrollo y el crecimiento de Fairlearn están guiados por la creencia de que el progreso significativo hacia sistemas de IA más justos requiere aportes de una amplia gama de perspectivas, que van desde científicos de datos, desarrolladores y tomadores de decisiones comerciales hasta las personas cuyas vidas pueden verse afectadas por las predicciones de los sistemas de IA.

source: Code of conduct
es: Código de conducta

source: Fairlearn follows the `Fairlearn Organization's Code of Conduct <https://github.com/fairlearn/governance/blob/main/code-of-conduct.md>`_.
es: Fairlear sigue el `Código de Conducta de la Organización de Fairlearn<https://github.com/fairlearn/governance/blob/main/code-of-conduct.md>`_.

source: Project focus areas
es: Áreas de enfoque del proyecto

source: *Last update: May 16, 2021*
es: * Última actualización: 16 de mayo de 2021 *

source: As an open-source project, Fairlearn strives to incorporate the best of research and practice. AI is a rapidly evolving field, and fairness in AI is all the more so. We therefore encourage researchers, practitioners, and other stakeholders to contribute fairness metrics and assessment tools, unfairness mitigation algorithms, case studies and other educational materials to Fairlearn as we experiment, learn, and evolve the project together.
es: Como proyecto de código abierto, Fairlearn se esfuerza por incorporar lo mejor de la investigación y la práctica. La IA es un campo en rápida evolución, y la justicia en la IA lo es aún más. Por lo tanto, alentamos a los investigadores, profesionales y a aquellos que estén interesades a contribuir con métricas de equidad y herramientas de evaluación, algoritmos de mitigación de la injusticia, estudios de casos y otros materiales educativos a Fairlearn mientras experimentamos, aprendemos y desarrollamos el proyecto juntos.

source: *Decrease adoption barriers for the current assessment and mitigation tools in Fairlearn*
es: *Disminuir las barreras de adopción para las herramientas actuales de evaluación y mitigación en Fairlearn*

source: **Move towards compatibility with scikit-learn**: identify incompatible aspects, improve code towards compatibility. While we aim for compatibility there may be aspects that are too restricting for Fairlearn, so this may need to be evaluated on a case-by-case basis.
es: **Avanzar hacia la compatibilidad con scikit-learn**: identificar aspectos incompatibles, mejorar el código hacia la compatibilidad. Si bien nuestro objetivo es la compatibilidad, puede haber aspectos que sean demasiado restrictivos para Fairlearn, por lo que es posible que deba evaluarse caso por caso.

source: *Grow and nurture a diverse community of contributors*
es: *Crecer y cultivar una comunidad diversa de colaboradores*

source: **Reach out** with feedback on what is working and what is not working; suggest how to improve things; point out where documentation, our processes or any other aspect of the projects create barriers of entry.
es: **Comuníquese** con comentarios sobre lo que está funcionando y lo que no; sugiera cómo mejorar las cosas; señale dónde la documentación, nuestros procesos o cualquier otro aspecto de los proyectos crean barreras de entrada.

source: **Add tests and improve testing infrastructure.**
es: **Agregar y mejorar la infraestructura de pruebas de código.**

source: *Create metrics, assessment tools, and algorithms to cover more complex ML tasks*
es: *Crear métricas, herramientas de evaluación y algoritmos para cubrir tareas de aprendizaje automático (AA) más complejas*

source: **Create notebooks and use cases** that deal with :ref:`concrete fairness issues <contributing_example_notebooks>` in complex ML tasks including ranking, counterfactual estimation, text, computer vision, speech, etc.
es: **Crear cuadernos y casos de uso** que se ocupen de :ref:`problemas concretos de equidad <contributing_example_notebooks>` en tareas complejas de AA que incluyen clasificación, estimación contrafactual, texto, visión por computadora, habla, etc.

source: **Lead and participate in contribution efforts** around under-researched, but practically relevant ML areas in ranking, counterfactual estimation, text, computer vision, speech, etc. These are likely to be mixed research / practice efforts and we expect substantial contributor commitment before embarking on these.
es: **Dirigir y participar en esfuerzos de contribución** en áreas de AA poco investigadas, pero prácticamente relevantes en clasificación, estimación contrafactual, texto, visión por computadora, habla, etc. Es probable que sean esfuerzos mixtos de investigación / práctica y esperamos un contribuyente sustancial compromiso antes de embarcarse en estos.

source: Governance
es: Gobernanza

source: Maintainers
es: Mantenedores

source: The maintainers of the Fairlearn project are
es: Los mantenedores del proyecto Fairlearn son

source: Project history
es: Historia del proyecto

source: The project was greatly expanded in the second half of 2019 thanks to the involvement of many contributors from Azure ML and Microsoft Research. At that time, the project started to have regular releases.
es: El proyecto se expandió enormemente en la segunda mitad de 2019 gracias a la participación de muchos colaboradores de Azure ML y Microsoft Research. En ese momento, el proyecto comenzó a tener lanzamientos regulares.

source: Citing Fairlearn
es: Citando a Fairlearn

source: If you wish to cite Fairlearn in your work, please use the following:
es: Si desea citar Fairlearn en su trabajo, utilice lo siguiente:

source: Frequently asked questions
es: Preguntas frecuentes
